{"pages":[{"title":"关于我","text":"####关于我我是有理想的小青年! 待完善哈~~~","path":"about/index.html","date":"01-07","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"04-17","excerpt":""},{"title":"404","text":"","path":"404/index.html","date":"04-17","excerpt":""}],"posts":[{"title":"我以为我很惨，其实我很幸运","text":"从小到大，在亲人的眼中，我是一位长相出众、惹人喜爱、能干的女孩👧，是的，我也觉得自己很漂亮、很能干。下面与大家分享一下我的童年. 爸爸妈妈很早就结婚了，怀孕两次都流了，在一起几年后，怀孕七个月生下了只有两斤多的我，听奶奶说：医生当时建议扔掉算了，难以养活，乡下的医疗条件，乡下的妇女生完孩子立马就回家修养，因为早产、因为瘦小，小时候经常生病，差点死掉，因为乡下的习俗：一边爷爷奶奶陪我在医院住院，一边请法师为我祈福（36次），我的爷爷奶奶在医院照顾生病的我，连续七天没洗澡，我的爸爸妈妈在广州打工，听到我病重的消息，赶紧辞职跑回家，我爸爸的妈妈，说要养猪，不能来医院看我，呵呵，真的好可笑。（补充一下：我的爸爸是上门女婿，照顾我的按理说是外婆外婆，因为经常住在一起，我称爷爷奶奶）。不管遇到村里的某某，都要我好好孝顺我的爷爷奶奶，为了我，真的付出了很多，我也一直铭记在心，我的奶奶已经去世六年了，我的爷爷，我一直好好爱着他，和弟弟妹妹们一起陪着他，有好吃的、好玩的都带上他。 五岁后，我的身体慢慢恢复健康了，在同龄的孩子眼里，我是幸福的，我喜欢什么，父母就给我购买什么，每年生日都会来亲戚庆贺，在爷爷奶奶，父母的教导下，我除了成绩不好，为人处事、待人接物顶呱呱，村里人都对我赞不绝口，包括现在也是。 11岁时，有了妹妹，13岁，有了弟弟，爸爸妈妈每晚要去菜市场售货，我每晚要带着妹妹弟弟一起睡觉，每晚都不敢睡，深怕来坏人（租的房子），每天要帮妹妹弟弟洗澡、要洗全家人的衣服、还要帮全家人折衣服等琐碎的事情，每天自己去读书前，还要送他们去上学，周末的事情更多了，家务活全是我。我很羡慕我的同学，父母只生了她，而我却要做这么多的事情，爸爸说，外面坏人多，不要出去玩，周末我都几乎没出去玩过，带着弟弟妹妹在家看电视（只有几个台），或者同学来我家玩。弟弟妹妹们大些了，每周五、周六的夜晚，我要帮父母去售货（卖菜），连续了好多年，直到24岁我结婚。说实话，从11岁～16岁，我觉得自己很煎熬、很痛苦，同龄的人是被父母宠着、幸福着，我却要做这么多的事，有时候还得不到父母的表扬。 19岁，我参加工作了，实习期老板看我工作认真、刻苦努力，留下了我，老板、同事们待我很好，我一呆就是5年，在工作的这五年里，我觉得自己有成就感、充实感、幸福感，同时觉得自己很幸福、很幸运。自己的工作越来越顺心，爸爸妈妈的事业越来越红火，弟弟妹妹们也长大了，都很爱我，关心我，我需要什么时，马上拿到我面前，因为爸爸妈妈说，大姐姐带你们辛苦了，你们要好好孝敬她，听她的话。上班一年后，爸爸买了一辆小型越野车，让我开车上下班，使我更加被人关注和羡慕，我自己也觉得很开心、很有面子吧，因为我们家兄弟姐妹多，别人觉得我们家很穷，爸爸妈妈帮我买一台电脑，别人说，啊，你家有电脑，我家买了房子，别人说，两、三万也是房子，四、五万也是房子，可惜，房子、装修、电器一套下来也是好几十万。我父母是个特爱面子的人，深怕别人瞧不起我们，怕我们受委屈。虽然，家中有些积蓄，但是除了花在我们几个孩子身上，父母自己舍不得用，父母的朋友说：只晓得挣钱，不晓得用。 慢慢地，什么都好了，就是自己的婚姻没着落，我的父母急的不行吖。22那年，我换了一个更体面的工作（政府部门工作），在姑姑的引荐下认识了我的老公，我和老公，半年订婚，认识一年结婚，现在我们结婚八个月了，都说，男人结婚后，对你的好会减少，我觉得老公却恰恰相反，对我好的难以形容，有时候，我向她人提起我的老公，都觉得我是在秀恩爱，不管别人怎么觉得，我自己觉得幸福就好。现在我和老公在省城工作，因为嫁的近，娘家离婆家，走路只需要7分钟，因为婆家房子多，结婚后，婆婆给我们布置了一套新房子，去婆家和娘家的距离差不多，都只需要7分钟左右，每次从省城回家，婆婆会准备很多好吃的零食、准备丰富的饭菜，娘家也是不停打电话去吃饭，在婆家吃饭时，婆婆每次做我喜欢吃的龙虾、鱼、墨鱼肉汤，娘家每次做老公爱吃的辣椒炒肉、苋菜，我很幸福、很幸运。有的父母，只想着挑刺啥的，我们的父母，希望我们能够相信相爱，不成为我们的负担，而且特别勤奋。我现在唯一的遗憾：就是结婚八个月了，还没有怀孕，我希望自己能早些怀孕 ，谢谢您的观看。","path":"2019/07/14/我以为我很惨，其实我很幸运/","date":"07-14","excerpt":""},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment refer:How12hello,world!![name](path)","path":"2019/03/21/hello-world/","date":"03-21","excerpt":""},{"title":"线性表","text":"线性表，是一种像线一样的表，例如车站内排队买车票的人，学校食堂排队打饭的学生，他们都是一个排着一个，如同一根线串起来，组成的一条队列就是线性表。线性表是数据结构中最常用且最简单的一种结构，它是由零个或多个数据元素的有限序列. 线性表按物理结构划分为顺序存储和链式存储。顺序存储：用一段地址连续的存储单元依次存储线性表的数据元素。线性表的数据结构： class SQList{ int []data = new int[MAX]; int length; } 初始化一个成员变量list,在线性表的某个位置插入值： public boolean insert(int pos,int value) { SQList tempList = list; if(pos &lt; 0) { return false; } //先比较，确定位置 int inserPosition = pos; for(int i=list.length-1;i &gt; inserPosition;i--) { list.data[i+1] = list.data[i];//最后一个往后移 } list.data[inserPosition] = value; list.length++; return true; } 按顺序插入： public void insert(int value) { int inserPosition = -1; for(int i =0;i&lt;list.length;i++) { if(value &lt;= list.data[i]) { inserPosition = i; break; } //遍历完还没有小的就放最后面 if(i == list.length-1 &amp;&amp; inserPosition ==-1) { inserPosition = list.length; } } for(int i=list.length-1;i &gt;= inserPosition;i--) { list.data[i+1] = list.data[i];//最后一个往后移 } list.data[inserPosition] = value; list.length++; } 删除操作： public int delete(int pos) { if(pos &lt; 0 || pos &gt; list.length) { return -1; } int value = list.data[pos]; for(int i=pos;i&lt;list.length;i++) { list.data[i] = list.data[i+1]; } list.length--; return value; } 以上简化了异常流程，重点突出线性表的增删，基本上就是对数组的操作，顺序存储的优点是查找方便，通过下标直接返回其值，而插入删除需要移动大量的元素，较为不便，那么有没有更加方便插入与删除的方式呢？下面来介绍增删方便的链表结构： 链表是由一个或若干结点组成的结构，每个结点由数据域与指针域组成。每个结点只包含一个指针，称之为单链表，单链表的第一个结点的存储位置叫做头指针。有时为了操作方便，我们在链表的头部设置一个结点，称之为头结点。结点的结构： class Node{ Object data; Node next; } 默认新建一个头结点head指向链表的头部，在结点的头部插入数据： public void insertHead(Object data) { Node newNode = new Node(data); if(head == null) { head = newNode; }else { newNode.next = head; head = newNode; } } 然后在结点的尾部插入： public void insertFoot(Object data) { Node newNode = new Node(data); if(head == null) { head = newNode; }else { Node temp = head; while(temp.next !=null) { temp = temp.next; } temp.next = newNode; } } 头部的删除很简单哟，虽然写的很粗俗： public void deleteHead() { if(head == null) { return ; } head = head.next; } 尾部的删除： public void deleteFoot() { Node temp = head; Node pre = head; while(temp.next!=null) { pre = temp; temp = temp.next; } pre.next = null; } 获取链表的第i个数据，感觉多此一举： public Object getData(int i){ if(i &lt; 0) return -1 ; int j = 0; Node temp = head; while(j &lt; i &amp;&amp; temp.next != null) { temp = temp.next; j++; } return temp.data; } ok,单链表的操作大致就这样。以后还有什么错的，待补充的再补上。 今日，美国以叙利亚化学武器袭击事件为由进行军事打击，而在今天上午美英法三国对叙利亚的空袭成真,表面上的“化武袭击”，但时至今日也没拿出直接证明是巴沙尔政权所为，发起战争的理由好像挺复杂的，但作为一个吃瓜群众，我们希望的是世界和平。。。","path":"2018/04/15/线性表/","date":"04-15","excerpt":""}]}